package days03;

/**
 * @author kenik  
 * @date 2025. 8. 20. 오후 2:03:03 
 * @subject   음수표현법 설명 ( 2의 보수법 )
 * @content 
 */ 
public class Ex05 {

	public static void main(String[] args) {
		
		// 'A' -> 65 -> 00000000 01000001
		// -10 [음수표현방법]
		/* [ 10진수-> 2진수 진법변환 ]
		 * 10      -> [0][][][] [1][0][1][0]   
		 * -10 정수 -> [1][][][] [1][0][1][0]   
		 * |10| 또는 |-10|  ->  10 부호와 절대치 X
		 * 
		 * [2의 보수법] 음수표현법
		 *  -10
		 *  1) 절대값  |-10|  ->  10
		 *  2) 1의 보수           0000 1010
		 *                       1111 0101
		 *  3) +1                0000 0001
		 *                       1111 0110
		 * 문제)  어떤 음수를 2의 보수법을 취해서 나온 결과가 ?  1010 1010  
		 *    -86     5
		 *    -169    1
		 *    -84     1         
		 *    	        1010 1010
		 *    3)-1              1
		 *              1010 1001 
		 *    2)1의보수  0101 0110 
		 *    3)절대값    64+16+4+2 = 86  
		 *             -86                
		 * */
		

	}//main

}//class







